<details><summary><tt>terraform ryandbrown/app apply</tt></summary>

```

 will perform the following actions:

  # aws_s3_object.version_info will be updated in-place
  ~ resource "aws_s3_object" "version_info" {
      ~ content                = <<-EOT
          - main_commit=fdbbca921eabdae17f0c2a6a5955676ac9201cd6
          - main_branch=ryandbrown/terraform_139_bump
          - main_version=pre-260
          - private_commit=95f3f0ce1bf97bf88efa967e621e228580ff4745
          + main_commit=554d3c62202c4b60194be26d55f4ff6f42735aea
          + main_branch=main
          + main_version=pre-261
          + private_commit=aee29f439a06309d8c14fae1349e85606415a243
            private_branch=main
        EOT
        id                     = "terraform-app/version_info/ryandbrown.txt"
        tags                   = {}
      ~ version_id             = "FwFpR3u_rEyRUO6iF9pBywUUsziSA4kM" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # null_resource.kms_lambda_processors_build will be created
  + resource "null_resource" "kms_lambda_processors_build" {
      + id = (known after apply)
    }

  # module.app_launch_template[0].aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-065fb4bbd1a87f07d"
      ~ image_id                             = "ami-04200fab17c138586" -> "ami-00725840b2f45b07f"
      ~ latest_version                       = 4 -> (known after apply)
        name                                 = "ryandbrown-app20230419182036051500000044"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "app"
        }
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.idp_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-0e942e065e35bedda"
      ~ image_id                             = "ami-04200fab17c138586" -> "ami-00725840b2f45b07f"
      ~ latest_version                       = 4 -> (known after apply)
        name                                 = "ryandbrown-idp2023041918200280590000003d"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "idp"
        }
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_cloudwatch_event_rule.replicate will be created
  + resource "aws_cloudwatch_event_rule" "replicate" {
      + arn            = (known after apply)
      + description    = "Capture disallowed replicate events"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + eventName         = [
                  + "ReplicateKey",
                ]
              + eventSource       = [
                  + "kms.amazonaws.com",
                ]
              + requestParameters = {
                  + keyId         = [
                      + "mrk-2631d5901d8b4eee920fac69d8f84c33",
                    ]
                  + replicaRegion = [
                      + {
                          + anything-but = [
                              + "us-west-2",
                              + "us-east-1",
                            ]
                        },
                    ]
                }
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "ryandbrown-mr-replicate-events"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "fisma" = "Q-LG"
        }
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_cloudwatch_event_rule.update_primary_region will be created
  + resource "aws_cloudwatch_event_rule" "update_primary_region" {
      + arn            = (known after apply)
      + description    = "Capture disallowed update primary region events"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + eventName         = [
                  + "UpdatePrimaryRegion",
                ]
              + eventSource       = [
                  + "kms.amazonaws.com",
                ]
              + requestParameters = {
                  + keyId         = [
                      + "mrk-2631d5901d8b4eee920fac69d8f84c33",
                    ]
                  + replicaRegion = [
                      + {
                          + anything-but = [
                              + "us-west-2",
                              + "us-east-1",
                            ]
                        },
                    ]
                }
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "ryandbrown-mr-update-primary-region-events"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "fisma" = "Q-LG"
        }
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_cloudwatch_event_target.sns has moved to module.kms_keymaker_multiregion_primary_uw2.aws_cloudwatch_event_target.decrypt
    resource "aws_cloudwatch_event_target" "decrypt" {
        id             = "ryandbrown-mr-decryption-events-ryandbrown-sns"
        # (4 unchanged attributes hidden)
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_cloudwatch_event_target.replicate will be created
  + resource "aws_cloudwatch_event_target" "replicate" {
      + arn            = "arn:aws:sns:us-west-2:894947205914:slack-otherevents"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "ryandbrown-mr-replicate-events"
      + target_id      = "ryandbrown-sns"
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_cloudwatch_event_target.update_primary_region will be created
  + resource "aws_cloudwatch_event_target" "update_primary_region" {
      + arn            = "arn:aws:sns:us-west-2:894947205914:slack-otherevents"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "ryandbrown-mr-update-primary-region-events"
      + target_id      = "ryandbrown-sns"
    }

  # module.kms_keymaker_multiregion_primary_uw2.aws_kms_key.login_dot_gov_keymaker_multi_region will be updated in-place
  ~ resource "aws_kms_key" "login_dot_gov_keymaker_multi_region" {
        id                                 = "mrk-2631d5901d8b4eee920fac69d8f84c33"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::894947205914:root"
                        }
                        Resource  = "*"
                        Sid       = ""
                    },
                  ~ {
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestedRegion" = "us-west-2"
                              + "kms:CallerAccount"   = "894947205914"
                            }
                        }
                        # (5 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestedRegion" = "us-west-2"
                              + "kms:CallerAccount"   = "894947205914"
                            }
                        }
                        # (5 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {}
        # (10 unchanged attributes hidden)
    }

  # module.kms_keymaker_multiregion_replica_ue1.aws_cloudwatch_event_target.sns will be destroyed
  # (because aws_cloudwatch_event_target.sns is not in configuration)
  - resource "aws_cloudwatch_event_target" "sns" {
      - arn            = "arn:aws:sns:us-east-1:894947205914:ryandbrown-mr-decryption-events" -> null
      - event_bus_name = "default" -> null
      - id             = "ryandbrown-mr-decryption-events-ryandbrown-sns" -> null
      - rule           = "ryandbrown-mr-decryption-events" -> null
      - target_id      = "ryandbrown-sns" -> null
    }

  # module.kms_keymaker_multiregion_replica_ue1.aws_kms_replica_key.login_dot_gov_keymaker_multi_region_replica will be updated in-place
  ~ resource "aws_kms_replica_key" "login_dot_gov_keymaker_multi_region_replica" {
        id                                 = "mrk-2631d5901d8b4eee920fac69d8f84c33"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::894947205914:root"
                        }
                        Resource  = "*"
                        Sid       = ""
                    },
                  ~ {
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestedRegion" = "us-east-1"
                              + "kms:CallerAccount"   = "894947205914"
                            }
                        }
                        # (5 unchanged attributes hidden)
                    },
                  ~ {
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestedRegion" = "us-east-1"
                              + "kms:CallerAccount"   = "894947205914"
                            }
                        }
                        # (5 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {}
        # (11 unchanged attributes hidden)
    }

  # module.kms_keymaker_multiregion_replica_ue1.aws_sns_topic.kms_events will be destroyed
  # (because aws_sns_topic.kms_events is not in configuration)
  - resource "aws_sns_topic" "kms_events" {
      - application_success_feedback_sample_rate = 0 -> null
      - arn                                      = "arn:aws:sns:us-east-1:894947205914:ryandbrown-mr-decryption-events" -> null
      - content_based_deduplication              = false -> null
      - fifo_topic                               = false -> null
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      - id                                       = "arn:aws:sns:us-east-1:894947205914:ryandbrown-mr-decryption-events" -> null
      - lambda_success_feedback_sample_rate      = 0 -> null
      - name                                     = "ryandbrown-mr-decryption-events" -> null
      - owner                                    = "894947205914" -> null
      - policy                                   = jsonencode(
            {
              - Id        = "kms_ct_sqs"
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:894947205914:ryandbrown-mr-decryption-events"
                      - Sid       = "KMSCTSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - signature_version                        = 0 -> null
      - sqs_success_feedback_sample_rate         = 0 -> null
      - tags                                     = {} -> null
      - tags_all                                 = {} -> null
    }

  # module.kms_keymaker_multiregion_replica_ue1.aws_sns_topic_policy.kms_events will be destroyed
  # (because aws_sns_topic_policy.kms_events is not in configuration)
  - resource "aws_sns_topic_policy" "kms_events" {
      - arn    = "arn:aws:sns:us-east-1:894947205914:ryandbrown-mr-decryption-events" -> null
      - id     = "arn:aws:sns:us-east-1:894947205914:ryandbrown-mr-decryption-events" -> null
      - owner  = "894947205914" -> null
      - policy = jsonencode(
            {
              - Id        = "kms_ct_sqs"
              - Statement = [
                  - {
                      - Action    = "SNS:Publish"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "events.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:894947205914:ryandbrown-mr-decryption-events"
                      - Sid       = "KMSCTSQS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.kms_keymaker_multiregion_replica_ue1.aws_sns_topic_subscription.kms_ct_sqs will be destroyed
  # (because aws_sns_topic_subscription.kms_ct_sqs is not in configuration)
  - resource "aws_sns_topic_subscription" "kms_ct_sqs" {
      - arn                             = "arn:aws:sns:us-east-1:894947205914:ryandbrown-mr-decryption-events:6e0544f5-f43b-44ad-ad59-145008ea7efe" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-west-2:894947205914:ryandbrown-kms-ct-events" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:894947205914:ryandbrown-mr-decryption-events:6e0544f5-f43b-44ad-ad59-145008ea7efe" -> null
      - owner_id                        = "894947205914" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:894947205914:ryandbrown-mr-decryption-events" -> null
    }

  # module.kms_lambda_processors_code.data.archive_file.lambda will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "./lambda/kms_lambda_processors.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./lambda/kms_lambda_processors/"
      + type                = "zip"
    }

  # module.kms_lambda_processors_code.null_resource.source_hash_check will be created
  + resource "null_resource" "source_hash_check" {
      + id       = (known after apply)
      + triggers = {
          + "source_hash" = "k45yWbxxf+ZoI0sDic2NjqGUhmOCnTTq+M533ICqnkw="
        }
    }

  # module.kms_logging.aws_lambda_function.cloudtrail_processor will be updated in-place
  ~ resource "aws_lambda_function" "cloudtrail_processor" {
      ~ description                    = "18F/identity-lambda-functions: KMS CT Log Processor" -> "KMS CT Log Processor"
      + filename                       = "./lambda/kms_lambda_processors.zip"
        id                             = "ryandbrown-cloudtrail-kms"
      ~ last_modified                  = "2023-04-19T18:20:43.256+0000" -> (known after apply)
      - s3_bucket                      = "login-gov.lambda-functions.894947205914-us-west-2" -> null
      - s3_key                         = "circleci/identity-lambda-functions/1815de9b0893548876138e7086391e210cc85813.zip" -> null
      ~ tags                           = {
            "environment" = "ryandbrown"
          - "source_repo" = "https://github.com/18F/identity-lambda-functions" -> null
        }
      ~ tags_all                       = {
          - "source_repo" = "https://github.com/18F/identity-lambda-functions" -> null
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.kms_logging.aws_lambda_function.cloudwatch_processor will be updated in-place
  ~ resource "aws_lambda_function" "cloudwatch_processor" {
      ~ description                    = "18F/identity-lambda-functions: KMS CW Log Processor" -> "KMS CW Log Processor"
      + filename                       = "./lambda/kms_lambda_processors.zip"
        id                             = "ryandbrown-cloudwatch-kms"
      ~ last_modified                  = "2023-04-19T18:15:05.603+0000" -> (known after apply)
      - s3_bucket                      = "login-gov.lambda-functions.894947205914-us-west-2" -> null
      - s3_key                         = "circleci/identity-lambda-functions/1815de9b0893548876138e7086391e210cc85813.zip" -> null
      ~ tags                           = {
            "environment" = "ryandbrown"
          - "source_repo" = "https://github.com/18F/identity-lambda-functions" -> null
        }
      ~ tags_all                       = {
          - "source_repo" = "https://github.com/18F/identity-lambda-functions" -> null
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.kms_logging.aws_lambda_function.event_processor will be updated in-place
  ~ resource "aws_lambda_function" "event_processor" {
      ~ description                    = "18F/identity-lambda-functions: KMS Log Event Processor" -> "KMS Log Event Processor"
      + filename                       = "./lambda/kms_lambda_processors.zip"
        id                             = "ryandbrown-kmslog-event-processor"
      ~ last_modified                  = "2023-04-19T18:14:30.311+0000" -> (known after apply)
      - s3_bucket                      = "login-gov.lambda-functions.894947205914-us-west-2" -> null
      - s3_key                         = "circleci/identity-lambda-functions/1815de9b0893548876138e7086391e210cc85813.zip" -> null
      ~ tags                           = {
            "environment" = "ryandbrown"
          - "source_repo" = "https://github.com/18F/identity-lambda-functions" -> null
        }
      ~ tags_all                       = {
          - "source_repo" = "https://github.com/18F/identity-lambda-functions" -> null
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.migration_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-0d3f6421363522d86"
      ~ image_id                             = "ami-04200fab17c138586" -> "ami-00725840b2f45b07f"
      ~ latest_version                       = 4 -> (known after apply)
        name                                 = "ryandbrown-migration2023041918172254100000002c"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "migration"
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.outboundproxy_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-003bfa907f02073cc"
      ~ image_id                             = "ami-08478ce852ec9fb75" -> "ami-0e58bfd53312cf0a9"
      ~ latest_version                       = 4 -> (known after apply)
        name                                 = "ryandbrown-outboundproxy2023041918172257410000002e"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "outboundproxy"
        }
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.pivcac_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-0dd4e9501ff97a186"
      ~ image_id                             = "ami-04200fab17c138586" -> "ami-00725840b2f45b07f"
      ~ latest_version                       = 4 -> (known after apply)
        name                                 = "ryandbrown-pivcac20230419181714345500000029"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "pivcac"
        }
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.ssm.aws_cloudwatch_event_rule.ssm_cmd["data-pull"] will be created
  + resource "aws_cloudwatch_event_rule" "ssm_cmd" {
      + arn            = (known after apply)
      + description    = "Capture when SSM command 'data-pull' used in ryandbrown"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName         = [
                      + "StartSession",
                      + "ResumeSession",
                      + "TerminateSession",
                    ]
                  + eventSource       = [
                      + "ssm.amazonaws.com",
                    ]
                  + requestParameters = {
                      + documentName = [
                          + "ryandbrown-ssm-document-data-pull",
                        ]
                    }
                }
              + detail-type = [
                  + "AWS API Call via CloudTrail",
                ]
              + source      = [
                  + "aws.ssm",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "ryandbrown-ssm-cmd-data-pull"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "fisma" = "Q-LG"
        }
    }

  # module.ssm.aws_cloudwatch_event_target.ssm_cmds["data-pull"] will be created
  + resource "aws_cloudwatch_event_target" "ssm_cmds" {
      + arn            = "arn:aws:logs:us-west-2:894947205914:log-group:aws-ssm-cmds-ryandbrown"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "ryandbrown-ssm-cmd-data-pull"
      + target_id      = "ryandbrown_SSMCmd_data-pull"
    }

  # module.ssm.aws_ssm_document.ssm_cmd["data-pull"] will be created
  + resource "aws_ssm_document" "ssm_cmd" {
      + arn              = (known after apply)
      + content          = <<-EOT
            ---
            schemaVersion: "2.2"
            description: "Calls the data-pull script in the IDP repo"
            parameters:
              
              subcommand:
                type: String
                default: null
                description: data-pull subcommand and its arguments, MUST BE SHELLESCAPED
              
              reason:
                type: String
                default: null
                description: reason for the pull, MUST BE SHELLESCAPED
              
              investigator:
                type: String
                default: null
                description: name of investigator, MUST BE SHELLESCAPED
              
              awsusername:
                type: String
                default: null
                description: AWS username of script runner, MUST BE SHELLESCAPED
              
            mainSteps:
            - action: "aws:runShellScript"
              name: "block1"
              inputs:
                runCommand: ["audit_message_path=$(mktemp)","command_output_path=$(mktemp)","echo \\*AWS_USER@Box\\*: \\`{{ awsusername }}\\` @ \\`$(hostname)\\` \u003e\u003e $audit_message_path","echo \\*Investigator\\*: {{ investigator }} \u003e\u003e $audit_message_path","echo \\*Reason\\*: {{ reason }} \u003e\u003e $audit_message_path","cd /srv/idp/current; ./bin/data-pull {{ subcommand }} 2\u003e\u003e $audit_message_path \u003e $command_output_path","cat $audit_message_path | notify-slack --username data-pull --text - --icon terminal --channel \"$(cat /etc/login.gov/keys/slackchannel)\" --webhook \"$(cat /etc/login.gov/keys/slackwebhook)\" --raise 1\u003e\u00262 || exit 1","cat $command_output_path"]
        EOT
      + created_date     = (known after apply)
      + default_version  = (known after apply)
      + description      = (known after apply)
      + document_format  = "YAML"
      + document_type    = "Command"
      + document_version = (known after apply)
      + hash             = (known after apply)
      + hash_type        = (known after apply)
      + id               = (known after apply)
      + latest_version   = (known after apply)
      + name             = "ryandbrown-ssm-cmd-data-pull"
      + owner            = (known after apply)
      + parameter        = (known after apply)
      + platform_types   = (known after apply)
      + schema_version   = (known after apply)
      + status           = (known after apply)
      + tags_all         = {
          + "fisma" = "Q-LG"
        }
    }

  # module.ssm.aws_ssm_document.ssm_cmd["passenger-restart"] will be updated in-place
  ~ resource "aws_ssm_document" "ssm_cmd" {
      ~ content          = <<-EOT
            ---
            schemaVersion: "2.2"
            description: "Restart passenger service via id-passenger-restart script"
            parameters:
              
            mainSteps:
            - action: "aws:runShellScript"
              name: "block1"
              inputs:
          -     runCommand:
          -     - id-passenger-restart
          +     runCommand: ["id-passenger-restart"]
        EOT
      ~ default_version  = "1" -> (known after apply)
      ~ document_version = "1" -> (known after apply)
      ~ hash             = "519c69a0b1a8e35bfb4f2c784e422bfe02629096c95ea0cc835886fbe65f75a4" -> (known after apply)
        id               = "ryandbrown-ssm-cmd-passenger-restart"
      ~ latest_version   = "1" -> (known after apply)
        name             = "ryandbrown-ssm-cmd-passenger-restart"
      ~ parameter        = [] -> (known after apply)
        tags             = {}
        # (12 unchanged attributes hidden)
    }

  # module.ssm.aws_ssm_document.ssm_cmd["scp-s3-cp"] will be updated in-place
  ~ resource "aws_ssm_document" "ssm_cmd" {
      ~ content          = <<-EOT
            ---
            schemaVersion: "2.2"
            description: "Part of the scp-s3 devops script, runs an aws s3 cp command on the box"
            parameters:
              
              sourcefile:
                type: String
                default: null
                description: source file to copy
              
              destfile:
                type: String
                default: null
                description: destination file to copy to
              
            mainSteps:
            - action: "aws:runShellScript"
              name: "block1"
              inputs:
          -     runCommand:
          -     - aws s3 cp {{ sourcefile }} {{ destfile }}
          +     runCommand: ["aws s3 cp {{ sourcefile }} {{ destfile }}"]
        EOT
      ~ default_version  = "1" -> (known after apply)
      ~ document_version = "1" -> (known after apply)
      ~ hash             = "db8d1d89d5f5583a9c0fcb53376a53f537f27e638b80889d880c164043056a7d" -> (known after apply)
        id               = "ryandbrown-ssm-cmd-scp-s3-cp"
      ~ latest_version   = "1" -> (known after apply)
        name             = "ryandbrown-ssm-cmd-scp-s3-cp"
      ~ parameter        = [
          - {
              - default_value = ""
              - description   = "source file to copy"
              - name          = "sourcefile"
              - type          = "String"
            },
          - {
              - default_value = ""
              - description   = "destination file to copy to"
              - name          = "destfile"
              - type          = "String"
            },
        ] -> (known after apply)
        tags             = {}
        # (12 unchanged attributes hidden)
    }

  # module.ssm.aws_ssm_document.ssm_cmd["work-restart"] will be updated in-place
  ~ resource "aws_ssm_document" "ssm_cmd" {
      ~ content          = <<-EOT
            ---
            schemaVersion: "2.2"
            description: "Restart idp-worker service via systemctl"
            parameters:
              
            mainSteps:
            - action: "aws:runShellScript"
              name: "block1"
              inputs:
          -     runCommand:
          -     - sudo systemctl restart idp-workers.target
          +     runCommand: ["sudo systemctl restart idp-workers.target"]
        EOT
      ~ default_version  = "1" -> (known after apply)
      ~ document_version = "1" -> (known after apply)
      ~ hash             = "255c4b81f59dfdd5ea5081ff37c09b4823ffc97a2a22d0f9d599c2229f5dd6c7" -> (known after apply)
        id               = "ryandbrown-ssm-cmd-work-restart"
      ~ latest_version   = "1" -> (known after apply)
        name             = "ryandbrown-ssm-cmd-work-restart"
      ~ parameter        = [] -> (known after apply)
        tags             = {}
        # (12 unchanged attributes hidden)
    }

  # module.worker_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-079cc6c6da2806e12"
      ~ image_id                             = "ami-04200fab17c138586" -> "ami-00725840b2f45b07f"
      ~ latest_version                       = 4 -> (known after apply)
        name                                 = "ryandbrown-worker20230419182035032100000042"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "worker"
        }
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.env-runner[0].module.gitlab_runner_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-0c60447a6a3f78453"
      ~ image_id                             = "ami-08478ce852ec9fb75" -> "ami-0e58bfd53312cf0a9"
      ~ latest_version                       = 4 -> (known after apply)
        name                                 = "ryandbrown-gitlab-env-runner2023041918230946400000004d"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "gitlab-env-runner"
        }
        # (11 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.env-runner[0].module.outbound_proxy.module.outboundproxy_cloudwatch_filters.aws_cloudwatch_metric_alarm.squid_denied_alarm will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "squid_denied_alarm" {
        id                        = "ryandbrown-squid-denials"
        tags                      = {}
      ~ treat_missing_data        = "breaching" -> "missing"
        # (17 unchanged attributes hidden)
    }

  # module.env-runner[0].module.outbound_proxy.module.outboundproxy_cloudwatch_filters.aws_cloudwatch_metric_alarm.squid_total_requests will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "squid_total_requests" {
        id                        = "ryandbrown-squid-total-requests"
        tags                      = {}
      ~ treat_missing_data        = "breaching" -> "missing"
        # (17 unchanged attributes hidden)
    }

  # module.env-runner[0].module.outbound_proxy.module.outboundproxy_launch_template.aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
        id                                   = "lt-0ac7634843fd4d8ad"
      ~ image_id                             = "ami-08478ce852ec9fb75" -> "ami-0e58bfd53312cf0a9"
      ~ latest_version                       = 4 -> (known after apply)
        name                                 = "ryandbrown-env-runner-outboundproxy20230419182153878700000048"
        tags                                 = {
            "domain"       = "ryandbrown.identitysandbox.gov"
            "main_git_ref" = "stages/ryandbrown"
            "prefix"       = "env-runner-outboundproxy"
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 9 to add, 19 to change, 4 to destroy.

```

</details>